Repository: DijonShala/Employee-Management-Web-App
Catalog: angular/src/locale/messages.*.xlf
Languages: sl

source: Month:
sl: Mesec

source: Enter month (1-12)
sl: Vnesite mesec (1-12)

source: Year:
sl: Leto

source: Enter year
sl: Vnesite leto

source: First name:
sl: Ime:

source: First name
sl: Ime

source: Last name:
sl: Priimek:

source: Last name
sl: Priimek

source: Phone number:
sl: Telefonska stevilka:

source: Phone number
sl: Telefonska stevilka

source: Job title:
sl: Naziv službe:

source: Job title
sl: Naziv službe

source: Role
sl: Vloga

source: Department
sl: Oddelek

source: Salary:
sl: Plača:

source: Salary
sl: Plača

source: Get salaries by Month / Year
sl: Plače po mescih / letih

source: Salaries for the selected month and year
sl: Plače za izbrani mesec in leto

source: No salaries found for the selected month and year.
sl: Za izbrani mesec in leto ni bilo najdenih nobenih plač.

source: Leave Requests
sl: Prošnja za dopust

source: No leave requests found.
sl: Ni bilo najedenih prošenj za dopust.

source: Filter Employee
sl: Filtriraj zaposlene

source: Filtered employee
sl: Filtrirani zaposleni

source: Show all
sl: Prikaži vse

source: No employee found.
sl: Ni bil najden noben zaposleni.

source: Tasks
sl: Naloge

source: No tasks found.
sl: Ni bila najdena nobena naloga.

source: « Previous
sl: Prejšni

source: Next »
sl: Naslednji

source: Good morning {{employee.firstName}} {{employee.lastName}}
sl: Dobro jutro {{employee.firstName}} {{employee.lastName}}

source: Clocked in since <strong>{{employee.clocked_in_time | date : 'H:mm'}}</strong>
sl: Vpisan od <strong>{{employee.clocked_in_time | date : 'H:mm'}}</strong>

source: Your working hours are <br /><strong>{{employee.clock_in_time | date : 'H:mm'}}</strong> to <strong>{{employee.clock_out_time | date : 'H:mm'}}</strong><span *ngIf="!ontime"> Free time </span><span *ngIf="ontime"> Work hours </span>
sl: Tvoje delovne ure so <br /><strong>{{employee.clock_in_time | date : 'H:mm'}}</strong> do <strong>{{employee.clock_out_time | date : 'H:mm'}}</strong><span *ngIf="!ontime"> Prosti čas </span><span *ngIf="ontime"> Delovni čas </span>

source: Clock in <i class="fa-regular fa-clock"></i>
sl: Prični <i class="fa-regular fa-clock"></i>

source: Clock out <i class="fa-solid fa-flag-checkered"></i>
sl: Končaj <i class="fa-solid fa-flag-checkered"></i>

source: Name:
sl: Ime:

source: Name
sl: Ime

source: Description:
sl: Opis:

source: Description
sl: Opis

source: Error updating department.
sl: Napaka pri posodobitvi oddelka.

source: Department successfully updated.
sl: Oddelek uspešno posodobljen.

source: Update department
sl: Posodobi oddelek

source: Delete {{department?.name}}
sl: Izbriši {{department?.name}}

source: Remove the department from the database.
sl: Odstrani oddelek iz podatkovne baze.

source: Delete
sl: Izbriši

source: Employees in {{ department?.name }}
sl: Zaposleni v {{ department?.name }}

source: No employees found in this department.
sl: Ni bilo najdenih zaposlenih v tem oddelku.

source: Departments
sl: Oddelki

source: Error adding department.
sl: Napaka pri dodajanju oddelka.

source: Department successfully added.
sl: Oddelek uspešno dodan.

source: Create department
sl: Ustvari oddelek

source: Start date:
sl: Začetek:

source: Due date:
sl: Rok:

source: Change status
sl: Spremeni stanje

source: Pending
sl: V teku

source: Approved
sl: Odobrjeno

source: Rejected
sl: Zavrnjeno

source: Delete leave
sl: Izbriši dopust

source: Reason:
sl: Razlog:

source: Reason
sl: Razlog

source: Start Date:
sl: Začetek:

source: Start Date
sl: Začetek:

source: End Date:
sl: Konec:

source: End Date
sl: Konec

source: Error adding leave.
sl: Napaka pri dodajanju dopusta.

source: Leave successfully added.
sl: Dopust uspešno dodan.

source: Add a leave request
sl: Dodaj prošnjo za dopust

source: Status
sl: Stanje

source: Applied At
sl: Prošnja oddana

source: User name
sl: Uporabnisko ime

source: Password
sl: Geslo

source: I have read and agreed to the <strong><a href="">Terms of Service</a> *</strong>
sl: Prebral sem in se strinjam z <strong><a href="">Pogoji Storitve</a> *</strong>

source: Sign in
sl: Prijavi se

source: Sign in to gain access to more clocking features.
sl: Prijavi se za več funkcij ure.

source: You must sign in before accessing clocking and calendar features.<br /> You must have administrator priviliges to access registration menu.
sl: Za dostop do ure in koledarja se morate prijaviti.<br /> Do registracijskega menija lahko dostopa le administrator.

source: Clockin
sl: Ura

source: Clock in
sl: Začni

source: Calendar
sl: Koledar

source: Analytics
sl: Analitike

source: Employee
sl: Zaposleni

source: Departments
sl: Oddelki

source: Tasks
sl: Naloge

source: Leaves
sl: Prošnje za dopust

source: Salaries
sl: Plače

source: Settings
sl: Nastavitve

source: Data added succesfully!
sl: Podatki uspešno dodani!

source: Delete Data
sl: Izbriši podatke

source: Data deleted succesfully!
sl: Podatki uspešno izbrisani

source: Log in
sl: Prijava

source: Log out
sl: Odjava

source: Invalid input.
sl: Neveljaven vhod.

source: Check this box to continue
sl: Za nadaljevanje označite to polje

source: Please select a valid option.
sl: Izberite veljavno opcijo.

source: Department ID
sl: ID oddelka

source: Street
sl: Ulica

source: City
sl: Mesto

source: Zip code
sl: Zip koda

source: Country
sl: Država

source: Employee added successfully!
sl: Zaposleni uspešno dodan!

source: Attempting to add an employee resulted in an error. Try again.
sl: Neuspeh! Poskusi znova.

source: Register user
sl: Registriraj uporabnika

source: Register a user to the company.
sl: Registriraj uporabnika.

source: User Name:
sl: Uporabniško ime:

source: User Name
sl: Uporabniško ime

source: Basic salary:
sl: Osnovna plača:

source: Basic salary
sl: Osnovna plača

source: Allowances:
sl: Bonus:

source: Allowances
sl: Bonus

source: Deductions:
sl: Odliv:

source: Deductions
sl: Odliv

source: Net pay
sl: Skupaj

source: Time
sl: Čas

source: Money
sl: Denar

source: Error adding salary.
sl: Prišlo je do napake.

source: Salary successfully added.
sl: Uspeh.

source: Add a salary to this employee
sl: Dodaj plačo zaposlenemu.

source: Old Password:
sl: Staro geslo:

source: New Password:
sl: Novo geslo:

source: Error changing Password.
sl: Napaka pri spremnijanju gesla.

source: Password changed successfully.
sl: Geslo uspešno spremenjeno.

source: Change Password
sl: Spremeni geslo

source: Users
sl: Uporabniki

source: Delete task
sl: Izbriši nalogo

source: Reason for request:
sl: Razlog za prošnjo:

source: Start date
sl: Začetek

source: End date:
sl: Konec:

source: End date
sl: Konec

source: Task description:
sl: Opis naloge:

source: Due date
sl: Rok

source: Employee updated successfully!
sl: Uspešno dodan zaposleni!

source: Attempting to update an employee resulted in an error. Try again.
sl: Neuspeh! Poskusite znova.

source: Change {{employee.userName}}'s user data
sl: Spremeni podatke {{employee.userName}}

source: Update the data of this user.
sl: Posodobi uporabnikove podatke.

source: Delete {{employee.userName}}'s user profile
sl: Izbriši uporabniški profil {{employee.userName}}

source: Remove the data of this user from the database.
sl: Izbriši uporabnika iz podatkovne baze.

source: {{ employee?.userName }} salaries
sl: {{ employee?.userName }} plače

source: Leave requests
sl: Prošnje za dopust

source: Create a task
sl: Ustvari nalogo
